artillery/db-without-calendar-table/get.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 1
      name: "Warm Up Application"
    - duration: 120
      arrivalRate: 1
      name: "Max Load"
  processor: "./get-random-availability.js"
  defaults:
    headers:
scenarios:
  - name: "Get availability for a listing"
    flow:
    - function: "getRandomListing"
    - get:
        url: "/bookings/availability/{{ listing_uuid }}"